#include <stdio.h>
// 다차원 배열
/*
1차원 : [][][][][]
2차원 :
[][][][][]
[][][][][]
[][][][][]
*/
int main() {
	// 예제1
	/*
	3 x 4
	  0   1   2   3
	0[ 1][ 2][ 3][ 4]
	1[ 5][ 6][ 7][ 8]
	2[ 9][10][11][12]
	*/
	
	int arr[3][4] = {
		{1, 2, 3, 4},
		{5, 6, 7, 8},
		{9, 10, 11, 12}
	};

	int arr2[3][4] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 };
	
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 4; j++) {
			printf("%d ", arr[i][j]);
		}
		printf("\n");
	};
	printf("\n");
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 4; j++) {
			printf("%d ", arr2[i][j]);
		}
		printf("\n");
	};
	printf("\n");
	return 0;
}